&НаКлиенте
Процедура Печать(ИдентификаторКоманды, МассивОбъектов)  Экспорт
	СтрПраметры = Новый Структура;
	СтрПраметры.Вставить("МассивОбъектов", МассивОбъектов);
	СтрПраметры.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	
    ОткрытьФорму("ВнешняяОбработка.ПротоколОНазначенииРазмераПенсииЗаВыслугуЛет.Форма.ФормаНастроек", СтрПраметры,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	МассивОбъектов	=	Новый Массив;
	МассивОбъектов.Добавить(Реквизит1);  
	ИдентификаторКоманды = "ПротоколОНазначенииРазмераПенсииЗаВыслугуЛет";
	Печать(ИдентификаторКоманды, МассивОбъектов);
КонецПроцедуры
